In [93]:
# import dependencies
import os
import pandas as pd
import psycopg2
from sqlalchemy import create_engine
#from sqlalchemy import 
from config import (user, password)

In [95]:
# create engine with create_engine
engine = create_engine(f'postgresql://{user}:{password}@localhost:5432/Pewlett Hackard Employees')

# create connection with engine.connect()
conn = engine.connect()

In [ ]:
# read in data from postgresql use JOIN to pull data I need for analysis 
# verses pullingeach table and merging
employee_data = pd.read_sql(sql="""SELECT s.salary,e.emp_no, dd.dept_name
                                    FROM Employee e 
                                    JOIN Salaries s
                                    ON e.emp_no = s.emp_no
                                    JOIN Dept_emp de
                                    ON de.emp_no = e.emp_no
                                    JOIN Dept_departments dd
                                    ON de.dept_no =dd.dept_no""", con=conn)

In [113]:
employee_data

        salary  emp_no           dept_name
0        60117   10001         Development
1        78228   10005     Human Resources
2        72488   10010          Production
3        72488   10010  Quality Management
4        42365   10011    Customer Service
...        ...     ...                 ...
331598   87170  499967               Sales
331599   41002  499972         Development
331600   40000  499985            Research
331601   52282  499987               Sales
331602   40000  499998             Finance

[331603 rows x 3 columns]

In [108]:
x_axis = salary_data["salary"]
y_axis = salary_data["emp_no"]

In [ ]:
plt.figure(figsize=(20,10))
plt.car(x_axis, )

In [77]:
data = engine.execute("SELECT * FROM titles")

In [78]:
for row in data:
    
    print(row[1])

Staff
Senior Staff
Assistant Engineer
Engineer
Senior Engineer
Technique Leader
Manager

In [86]:
salary = engine.execute("SELECT salary FROM Salaries")

In [ ]:
salary_emp_no = engine.e

In [85]:
salary_per_employee

for row in salary_per_employee:
 print(row)